## OpenTofu Plan

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_management_group_subscription_association.connectivity_nonprod will be created
  + resource "azurerm_management_group_subscription_association" "connectivity_nonprod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-connectivity"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.connectivity_prod will be created
  + resource "azurerm_management_group_subscription_association" "connectivity_prod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-connectivity"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.devops_nonprod will be created
  + resource "azurerm_management_group_subscription_association" "devops_nonprod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-corp"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.devops_prod will be created
  + resource "azurerm_management_group_subscription_association" "devops_prod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-corp"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.edge_nonprod will be created
  + resource "azurerm_management_group_subscription_association" "edge_nonprod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-online"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.edge_prod will be created
  + resource "azurerm_management_group_subscription_association" "edge_prod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-online"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.esb_nonprod will be created
  + resource "azurerm_management_group_subscription_association" "esb_nonprod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-corp"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.esb_prod will be created
  + resource "azurerm_management_group_subscription_association" "esb_prod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-corp"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.iam_nonprod will be created
  + resource "azurerm_management_group_subscription_association" "iam_nonprod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-online"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.iam_prod will be created
  + resource "azurerm_management_group_subscription_association" "iam_prod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-online"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.identity will be created
  + resource "azurerm_management_group_subscription_association" "identity" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-identity"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.observability_nonprod will be created
  + resource "azurerm_management_group_subscription_association" "observability_nonprod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-corp"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.observability_prod will be created
  + resource "azurerm_management_group_subscription_association" "observability_prod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-corp"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.payment_nonprod will be created
  + resource "azurerm_management_group_subscription_association" "payment_nonprod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-online"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.payment_prod will be created
  + resource "azurerm_management_group_subscription_association" "payment_prod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-online"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.security_nonprod will be created
  + resource "azurerm_management_group_subscription_association" "security_nonprod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-security"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.security_prod will be created
  + resource "azurerm_management_group_subscription_association" "security_prod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-security"
      + subscription_id     = (sensitive value)
    }

  # azurerm_role_assignment.connectivity_nonprod_sp_gha_tf_apply_platform will be created
  + resource "azurerm_role_assignment" "connectivity_nonprod_sp_gha_tf_apply_platform" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.connectivity_prod_sp_gha_tf_apply_platform will be created
  + resource "azurerm_role_assignment" "connectivity_prod_sp_gha_tf_apply_platform" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.devops_nonprod_sp_gha_tf_apply_landingzone will be created
  + resource "azurerm_role_assignment" "devops_nonprod_sp_gha_tf_apply_landingzone" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.devops_prod_sp_gha_tf_apply_landingzone will be created
  + resource "azurerm_role_assignment" "devops_prod_sp_gha_tf_apply_landingzone" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.edge_nonprod_sp_gha_tf_apply_landingzone will be created
  + resource "azurerm_role_assignment" "edge_nonprod_sp_gha_tf_apply_landingzone" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.edge_prod_sp_gha_tf_apply_landingzone will be created
  + resource "azurerm_role_assignment" "edge_prod_sp_gha_tf_apply_landingzone" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.esb_nonprod_sp_gha_tf_apply_landingzone will be created
  + resource "azurerm_role_assignment" "esb_nonprod_sp_gha_tf_apply_landingzone" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.esb_prod_sp_gha_tf_apply_landingzone will be created
  + resource "azurerm_role_assignment" "esb_prod_sp_gha_tf_apply_landingzone" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.iam_nonprod_sp_gha_tf_apply_landingzone will be created
  + resource "azurerm_role_assignment" "iam_nonprod_sp_gha_tf_apply_landingzone" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.iam_prod_sp_gha_tf_apply_landingzone will be created
  + resource "azurerm_role_assignment" "iam_prod_sp_gha_tf_apply_landingzone" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.identity_sp_gha_tf_apply_platform will be created
  + resource "azurerm_role_assignment" "identity_sp_gha_tf_apply_platform" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.observability_nonprod_sp_gha_tf_apply_landingzone will be created
  + resource "azurerm_role_assignment" "observability_nonprod_sp_gha_tf_apply_landingzone" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.observability_prod_sp_gha_tf_apply_landingzone will be created
  + resource "azurerm_role_assignment" "observability_prod_sp_gha_tf_apply_landingzone" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.payment_nonprod_sp_gha_tf_apply_landingzone will be created
  + resource "azurerm_role_assignment" "payment_nonprod_sp_gha_tf_apply_landingzone" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.payment_prod_sp_gha_tf_apply_landingzone will be created
  + resource "azurerm_role_assignment" "payment_prod_sp_gha_tf_apply_landingzone" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.security_nonprod_sp_gha_tf_apply_platform will be created
  + resource "azurerm_role_assignment" "security_nonprod_sp_gha_tf_apply_platform" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.security_prod_sp_gha_tf_apply_platform will be created
  + resource "azurerm_role_assignment" "security_prod_sp_gha_tf_apply_platform" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 34 to add, 0 to change, 0 to destroy.
```
